# Command-line tools
brew 'wget'
brew 'jq'

# Updates git to latest
brew 'git'

# Docker
brew 'boot2docker'

# Virtualization software
cask 'virtualbox'
cask 'vagrant'

# Terminal replacement
cask 'iterm2'

# Install rbenv a ruby manager for installing/running ruby
brew 'ruby-build' # ruby-build is needed by rbenv
brew 'rbenv

# Node.js version manager
brew 'nvm'

# Development tools
cask 'visual-studio-code'
brew 'vim'

# Java Development Tools
cask 'intellij-idea-ce'
cask 'visualvm'

# Browsers
cask 'google-chrome'

# Personal items
cask 'evernote'
cask 'spotify'
cask 'lastpass'
cask 'flycut'
