tap 'caskroom/cask'
tap 'caskroom/versions'

#########
# Tools #
#########

# Install rbenv a ruby manager for installing/running ruby
# ruby-build is needed by rbenv
brew 'ruby-build'
brew 'rbenv'

# Updates git to latest 2.X
brew 'git'

# Provides protobuf CLI for compiling protobuf (done rarely)
brew 'protobuf'

# Docker
brew 'boot2docker'

# wget unix CLI
brew 'wget'

# Install Java 7 and the latest Java (8)
cask 'java'
cask 'java7'

# Maven
brew 'maven'

# Chef SDK (knife, chef, berkshelf, etc...)
cask 'chefdk'

# Virtualization software (often used by chef/test-kitchen)
# NOTE: If having issues with the versions installed, refer to: https://wiki.ucern.com/display/OPSINFRA/Enterprise+Chef+SDK
cask 'virtualbox'
cask 'vagrant'

# Apps
cask 'dropbox'
cask 'google-chrome'
cask 'firefox'

# IRC chat client
cask 'limechat'

# Slack desktop client
cask 'slack'

# Terminal
cask 'iterm2'

# Notetaking app
cask 'evernote'

# IntelliJ Community Edition (Java IDE)
cask 'intellij-idea-ce'

# Java debug tooling
cask 'visualvm'

# Text Editor - https://atom.io/
cask 'atom'

# Text Editor - https://www.sublimetext.com/3
cask 'sublime-text'

# Music
cask 'spotify'

# Personal items
cask 'lastpass'
cask 'flycut'

# Vim and plugin dependencies
brew 'vim'
brew 'cmake'
brew 'ctags'
